#+TITLE:     plantuml-babel.org
#+AUTHOR:    Derek Feichtinger
#+EMAIL:     dfeich@dflt1w
# #+DATE:      2012-11-18 Sun
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

#+LATEX_HEADER_EXTRA: \usepackage{svg}

# By default I do not want that source code blocks are evaluated on export. Usually
# I want to evaluate them interactively and retain the original results.
#+PROPERTY: header-args :eval never-export

* Information on the local installation
   #+BEGIN_SRC emacs-lisp :results output :exports results :eval query-export
   (princ (concat (format "Emacs version: %s\n" (emacs-version))
                  (format "org version: %s\n" (org-version))))
    
   #+END_SRC

   #+RESULTS:
   : Emacs version: GNU Emacs 26.1 (build 1, x86_64-pc-linux-gnu, GTK+ Version 3.22.30)
   :  of 2018-11-13
   : org version: 9.1.14

  #+BEGIN_SRC sh :results output :exports results :var jpath=(expand-file-name org-plantuml-jar-path) :eval query-export
  echo "Emacs variable org-plantuml-jar-path:$jpath\n\n"
  if test ! -r "$jpath"; then
     echo "ERROR: Cannot read the file"
     return
  fi
  java -jar "$jpath" -version
  echo "-------------------------"
  java -jar "$jpath" -checkversion
  #+END_SRC

  #+RESULTS:
  #+begin_example
  Emacs variable org-plantuml-jar-path:/home/dfeich/.emacs.d/javalib/plantuml.jar


  PlantUML version 1.2019.00 (Sun Jan 13 16:46:42 CET 2019)
  (GPL source distribution)
  Java Runtime: OpenJDK Runtime Environment
  JVM: OpenJDK 64-Bit Server VM
  Java Version: 1.8.0_191-8u191-b12-0ubuntu0.18.04.1-b12
  Operating System: Linux
  OS Version: 4.15.0-43-generic
  Default Encoding: UTF-8
  Language: en
  Country: US
  Machine: dflt2w
  PLANTUML_LIMIT_SIZE: 4096
  Processors: 4
  Max Memory: 4,651,483,136
  Total Memory: 313,524,224
  Free Memory: 306,980,040
  Used Memory: 6,544,184
  Thread Active Count: 1

  The environment variable GRAPHVIZ_DOT has not been set
  Dot executable is /usr/bin/dot
  Dot version: dot - graphviz version 2.40.1 (20161225.0304)
  Installation seems OK. File generation OK
  -------------------------
  PlantUML version 1.2019.00 (Sun Jan 13 16:46:42 CET 2019)

  Last available version for download : 1201900

  Your version is up to date.
  #+end_example


**  Help text

  #+BEGIN_SRC sh :results output :var jpath=(expand-file-name org-plantuml-jar-path) :eval query-export
  java -jar "$jpath" -help
  #+END_SRC

  #+RESULTS:
  #+begin_example
  Usage: java -jar plantuml.jar [options] -gui
	  (to execute the GUI)
      or java -jar plantuml.jar [options] [file/dir] [file/dir] [file/dir]
	  (to process files or directories)

  You can use the following wildcards in files/dirs:
	  ,*	means any characters but '/'
	  ?	one and only one character but '/'
	  ,**	means any characters (used to recurse through directories)

  where options include:
      -gui		To run the graphical user interface
      -tpng		To generate images using PNG format (default)
      -tsvg		To generate images using SVG format
      -teps		To generate images using EPS format
      -tpdf		To generate images using PDF format
      -tvdx		To generate images using VDX format
      -txmi		To generate XMI file for class diagram
      -tscxml		To generate SCXML file for state diagram
      -thtml		To generate HTML file for class diagram
      -ttxt		To generate images with ASCII art
      -tutxt		To generate images with ASCII art using Unicode characters
      -tlatex		To generate images using LaTeX/Tikz format
      -tlatex:nopreamble	To generate images using LaTeX/Tikz format without preamble
      -o[utput] "dir"	To generate images in the specified directory
      -DVAR1=value	To set a preprocessing variable as if '!define VAR1 value' were used
      -Sparam1=value	To set a skin parameter as if 'skinparam param1 value' were used
      -r[ecurse]		recurse through directories
      -I/path/to/file	To include file as if '!include file' were used
      -I/path/to/*.puml	To include files with pattern
      -charset xxx	To use a specific charset (default is UTF-8)
      -e[x]clude pattern	To exclude files that match the provided pattern
      -metadata		To retrieve PlantUML sources from PNG images
      -nometadata		To NOT export metadata in PNG/SVG generated files
      -checkmetadata		Skip PNG files that don't need to be regenerated
      -version		To display information about PlantUML and Java versions
      -checkversion	To check if a newer version is available for download
      -v[erbose]		To have log information
      -quiet		To NOT print error message into the console
      -debugsvek		To generate intermediate svek files
      -h[elp]		To display this help message
      -testdot		To test the installation of graphviz
      -graphvizdot "exe"	To specify dot executable
      -p[ipe]		To use stdin for PlantUML source and stdout for PNG/SVG/EPS generation
      -encodesprite 4|8|16[z] "file"	To encode a sprite at gray level (z for compression) from an image
      -computeurl|-encodeurl	To compute the encoded URL of a PlantUML source file
      -decodeurl		To retrieve the PlantUML source from an encoded URL
      -syntax		To report any syntax error from standard input without generating images
      -language		To print the list of PlantUML keywords
      -checkonly		To check the syntax of files without generating images
      -failfast		To stop processing as soon as a syntax error in diagram occurs
      -failfast2		To do a first syntax check before processing files, to fail even faster
      -pattern		To print the list of Regular Expression used by PlantUML
      -duration		To print the duration of complete diagrams processing
      -nbthread N		To use (N) threads for processing
      -nbthread auto	To use 4 threads for processing
      -timeout N		Processing timeout in (N) seconds. Defaults to 15 minutes (900 seconds).
      -author[s]		To print information about PlantUML authors
      -overwrite		To allow to overwrite read only files
      -printfonts		To print fonts available on your system
      -enablestats	To enable statistics computation
      -disablestats	To disable statistics computation (default)
      -htmlstats		To output general statistics in file plantuml-stats.html
      -xmlstats		To output general statistics in file plantuml-stats.xml
      -realtimestats	To generate statistics on the fly rather than at the end
      -loopstats		To continuously print statistics about usage
      -splash		To display a splash screen with some progress bar
      -progress		To display a textual progress bar in console
      -pipeimageindex N	To generate the Nth image with pipe option
      -stdlib		To print standart library info
      -extractstdlib	To extract PlantUML Standard Library into stdlib folder
      -filename "example.puml"	To override %filename% variable
      -preproc		To output preprocessor text of diagrams
      -cypher		To cypher texts of diagrams so that you can share them

  If needed, you can setup the environment variable GRAPHVIZ_DOT.
  #+end_example

